# Univariate analysis

## Measure of Dispersion

1. Variance
2. Standard deviation

In [1]:
# variance = how far numbers are spread out from their mean
# std dev =  It is calculated as the square root of variance

A low standard deviation indicates that the values tend to be close to the mean, while a high standard deviation indicates that the values are spread out over a wider range

In [2]:
import numpy as np
import pandas as pd

In [3]:
# read file

df = pd.read_excel('Online_Store_customer_data.xlsx')
df.head(4)

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Amount_spent
0,2019-01-01,151200,Female,19,Single,Kansas,Basic,Unemployment,Other,2051.36
1,2019-01-01,151201,Male,49,Single,Illinois,Basic,self-employed,Card,544.04
2,2019-01-01,151202,Male,63,Married,New Mexico,Basic,workers,PayPal,1572.60
3,2019-01-01,151203,Female,18,Single,Virginia,Platinum,workers,Card,1199.79

In [4]:
# calculate variance
var = df['Age'].var()

# Calculate standard deviation
std = df['Age'].std()

In [5]:
print(f' Variance of Age : {var:.3f}')
print(f" Standard deviation of Age : {std:.2f}")

 Variance of Age : 296.584
 Standard deviation of Age : 17.22

In [6]:
# calculate variance
var = df['Amount_spent'].var()

# Calculate standard deviation
std = df['Amount_spent'].std()

print(f' Variance of Amount_spent : {var:.2f}')
print(f" Standard deviation of Amount_spent : {std:.2f}")

 Variance of Amount_spent : 751325.01
 Standard deviation of Amount_spent : 866.79

In [7]:
df.describe()

       Transaction_ID         Age  Amount_spent
count      150.000000  150.000000    150.000000
mean    151367.573333   45.920000   1544.820933
std        125.167289   17.221619    866.790063
min     151200.000000   15.000000     15.370000
25%     151284.250000   33.000000    807.395000
50%     151332.500000   46.000000   1591.365000
75%     151476.750000   59.000000   2413.275000
max     151585.000000   77.000000   2999.980000

In [8]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Transaction_ID,150.0,151367.573333,125.167289,151200.00,151284.250,151332.500,151476.750,151585.00
Age,150.0,45.920000,17.221619,15.00,33.000,46.000,59.000,77.00
Amount_spent,150.0,1544.820933,866.790063,15.37,807.395,1591.365,2413.275,2999.98

In [9]:
df.describe(include=object).T

                 count unique        top freq
Gender             150      2     Female   86
Marital_status     150      2    Married   97
State_names        150     47   Colorado    7
Segment            150      4      Basic   76
Employees_status   150      4  Employees   52
Payment_method     150      3     PayPal   66